"""
if 条件1:
    条件1满足应作的事
    条件1满足应作的事
    ......
elif 条件2:
    条件2满足应做的事
    条件2满足应做的事
    ......
elif 条件n:
    条件n满足应做的事
    条件n满足应做的事
    ......
else:
    所有条件都不满足应做的事
    所有条件都不满足应做的事
    ......
"""

print("欢迎来到天天动物园")
height = float(input("请输入您的身高"))
vip = int(input("请输入您的vip等级"))
if height <= 1.3:
    print("您的身高不足1.3米,可享受半票优惠")
elif vip >= 3:
    print(f"您为{vip}级会员,可享受8.8折优惠")
elif height <= 1.3 and vip >=3:# 多条件判断下条件是互斥的,不会执行该语句
    print("您可凭借会员证携带另一位游客免费游玩")
elif int(input("请输入今天日期")) == 16:
    print("恭喜您,今天是幸运日可免费游玩")
else:
    print("您当前需缴纳50元门票")

